* zero-trust-catalog

A project to define an OSCAL catalog of controls for Zero Trust and related component models for
Red Hat products.

The OSCAL architecture is described in https://pages.nist.gov/OSCAL/resources/concepts/layer/.

This project uses [[https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-207.pdf][NIST SP 800-207 - Zero Trust Architecture]] as the definition of a desired Zero
Trust architectural state. The controls defined in [[https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-53r5.pdf][NIST SP 800-53 rev5]] and
[[https://github.com/cloud-native-security-controls/controls-catalog][Cloud Native Security Controls]] are used as a basis and cross-referenced with the architectural
tenets described in NIST SP 800-207.

The catalog of controls in this project is derived from the NIST maintained OSCAL content in:
https://github.com/usnistgov/oscal-content.

** Background Material

+ [[doc/README.org][OSCAL Notes]]

*** Requirements from NIST specifications

+ [[file:NIST/nist-sp-800-204b.org][NIST SP 800-204B]]
+ [[file:NIST/nist-sp-800-207a.org][NIST SP 800-207A]]

** DoD Zero Trust Overlays

The US Department of Defense has published a document called Zero Trust Overlays which takes the
security controls defined in NIST SP 800-53 Rev 5 and associates them with the DoD pillars of
zero trust.

*** Scripts

The ~dod-extractor.py~ script extracts the mappings from the Zero Trust Overlays PDF to produce
a YAML file containing all the mappings.

The ~merge-mappings.py~ script merges DoD mappings into the NIST controls YAML file to produce a
composite YAML file containing the NIST controls with additional properties.

#+begin_example yaml
- id: ac-2.1
  title: Automated System Account Management
  props:
  - name: label
    value: AC-2(1)
  - name: implementation-level
    ns: http://csrc.nist.gov/ns/rmf
    value: organization
  - class: dod-zero-trust-overlay
    name: Appendix A - Control Tables Allocated to Pillars
    value: User
  - class: dod-zero-trust-overlay
    name: Appendix C - User Pillar Overlay
    value: 1.5 Identity Federation & User Credentialing
#+end_example

The scripts need the ~pypdf~ and ~pyyaml~ python packages to be installed. The scripts can be
run using the provided ~Makefile~:

#+begin_src sh
% make
merge                Merge the DoD mappings into NIST controls
dod                  Extract the DoD mappings from the PDF
clean                Remove generated files
help                 This help
#+end_src

** Sample Queries

You need to install ~yq~ to make use of these queries.

+ [[https://github.com/mikefarah/yq?tab=readme-ov-file#install][yq - Installation instructions]]
+ [[https://mikefarah.gitbook.io/yq][yq - Documentation]]

*** Controls linked to ZTA Tenet 1

Find all controls that have been linked to *ZTA Tenet 1* with a ~zta-tenet~ property annotation:

#+begin_src sh :results output :exports both
yq '[.controls[]
   | select(contains({"props":[{"name":"zta-tenet","value":"1 -"}]}))]' \
   cnswp-v2-controls.yaml
#+end_src

#+RESULTS:
#+begin_example
- id: control-206
  class_: CNSWP-v2.0
  title: All cluster and workloads operators are authenticated
  props:
    - name: section
      value: Access
    - name: assurance-level
      value: N/A
    - name: risk-categories
      value: N/A
    - name: refs
      value: IA-7 Cryptographic Module Authentication
    - name: zta-tenet
      value: 1 - All data sources and computing services are considered resources
- id: control-207
  class_: CNSWP-v2.0
  title: cluster and worklods operate actions are evaluated against access control policies governing context, purpose, and output
  props:
    - name: section
      value: Access
    - name: assurance-level
      value: N/A
    - name: risk-categories
      value: N/A
    - name: refs
      value: IA-7 Cryptographic Module Authentication
    - name: zta-tenet
      value: 1 - All data sources and computing services are considered resources
#+end_example

*** Count of annotated controls

Count the number of controls that have ~zta-tenet~ annotations.

#+begin_src sh :results output :exports both
yq '[.controls[]
   | select(contains({"props":[{"name":"zta-tenet"}]})
            or contains({"props":[{"name":"x-"}]}))
   ] | length' \
   cnswp-v2-controls.yaml
#+end_src

#+RESULTS:
: 151

*** No zta-tenet annotation

Find all controls that don't have a ~zta-tenet~ property annotation

#+begin_src sh :results output :exports both
yq '[.controls[]
   | select(contains({"props":[{"name":"zta-tenet"}]}) == false
            and contains({"props":[{"name":"x-"}]}) == false)
   ] | .[] | .id' \
   cnswp-v2-controls.yaml
#+end_src

#+RESULTS:
: 0

*** Controls per section

List the number of mapped controls in each CNSWP section.

#+begin_src sh :results output :exports both
for s in Access Compute Deploy Develop Distribute Security\ Assurance
do
    C=`yq "[.controls[]
    | select(contains({\"props\":[{\"value\":\"${s}\"}]}))
    ] | length" cnswp-v2-controls.yaml`

    N=`yq "[.controls[]
    | select(contains({\"props\":[{\"value\":\"${s}\"}]}))
    | select(contains({\"props\":[{\"name\":\"zta-tenet\"}]}))
    ] | length" cnswp-v2-controls.yaml`

    echo "${s}:  ${N} of ${C} are mapped"
done
#+end_src

#+RESULTS:
: Access:  43 of 55 are mapped
: Compute:  23 of 35 are mapped
: Deploy:  3 of 6 are mapped
: Develop:  3 of 17 are mapped
: Distribute:  27 of 36 are mapped
: Security Assurance:  20 of 22 are mapped

Anything that is not mapped will have a ~x-note~ or ~x-query~ property.

*** X- notes

List the notes and queries that need to be reviewed.

#+begin_src sh :results output :exports both
yq '[.controls[] | .props[] | select(contains({"name":"x-"}))] | .[] | .value ' \
   cnswp-v2-controls.yaml | sort -u
#+end_src

#+RESULTS:
#+begin_example
Development infrastructure is a zero trust resource
Is there a relevant zero trust tenet to link with HSM secret storage
Need to consider key rotation requirements in id:control-197
Not directly related to tenets of zero trust
cryptographic secret storage
data integrity
data security
encryption at rest
high availability
identity attestation
relationship to zero trust?
resource isolation
resource isolation is not explicitly mentioned in tenets of zero trust
resource lifecycle management?
software quality
software quality feedback loop
#+end_example

*** Tenet mappings

List the number of mappings for each ZTA Tenet.

#+begin_src sh :results output :exports both
for n in 1 2 3 4 5 6 7
do
    MAPPINGS=`ack -c "${n} - " cnswp-v2-controls.yaml`
    echo "Tenet ${n} - ${MAPPINGS}"
done
#+end_src

#+RESULTS:
: Tenet 1 - 13
: Tenet 2 - 10
: Tenet 3 - 8
: Tenet 4 - 32
: Tenet 5 - 13
: Tenet 6 - 19
: Tenet 7 - 23

List all the mappings for each Tenet of Zero Trust.

#+begin_src sh :results output :exports both
for n in 1 2 3 4 5 6 7
do
    echo
    echo "Tenet ${n}"
    yq "[.controls[] | select(contains({\"props\":{\"value\": \"${n} -\"}}))]
    | .[] | .title" cnswp-v2-controls.yaml
done
#+end_src

